{

    "InvalidBuildRequest": "Invalid build request",
    "_InvalidBuildRequest.comment": "Message sent back to Visual Studio if an invalid build request was sent to the build server",
    "BuildNotFound": "Build {0} does not exist",
    "_BuildNotFound.comment": "Message sent back to Visual Studio or user when it queries for a build but the build no longer exists, for example an old build that has been deleted. {0} is the build number",
    "BuildUploaded": "Uploaded build request payload.",
    "_BuildUploaded.comment": "Message sent back to Visual Studio when it is queried for the build status and the build status is uploaded to server",
    "BuildExtracted": "Extracted app contents from uploaded build request",
    "_BuildExtracted.comment": "Message sent back to Visual Studio when it is queried for the build status and the build status is extracted on server file system",
    "BuildBuilding": "Building Cordova app.",
    "_BuildBuilding.comment": "Message sent back to Visual Studio when it is queried for the build status and the build status is currently building on server",
    "BuildComplete": "Build completed successfully.",
    "_BuildComplete.comment": "Message sent back to Visual Studio when it is queried for the build status and the build status is successfully completed",
    "BuildDownloaded": "Build completed and downloaded by client.",
    "_BuildDownloaded.comment": "Message sent back to Visual Studio when it is queried for the build status and the build status is downloaded from server",
    "EmulateDisabled": "Emulate is not enabled on this server.",
    "_EmulateDisabled.comment": "Message reported back to the client when they request emulation and it is disabled on the server",

    "NoResourcesForLanguage": "No resources defined for language {0}",
    "_NoResourcesForLanguage.comment": "Message sent back in browser if user requests resources for a language that does not have specfic resources",
    "BuildRetentionPreDelete": "Deleting eligible builds. Will delete {0} builds.",
    "_BuildRetentionPreDelete.comment": "Message printed to console just before we delete old builds. {0} is the number of builds we will delete",
    "BuildRetentionDelete": "Deleting build {0} from {1}",
    "_BuildRetentionDelete.comment": "Message printed to console for each build deleted. {0} is the build number, and {1} is the build location",
    "BuildManagerDirInit": "Build will be executed under: {0}",
    "_BuildManagerDirInit.comment": "Message printed to console when a build request is recieved. {0} is the path where the build will exist.",
    "LogFileReadError": "Error from reading build log file {0}:",
    "_LogFileReadError.comment": "Message printed to console when we fail to retrieve the build log. {0} is the location of the file we tried to read.",
    "UploadSavedSuccessfully": "Saved uploaded build to {0}",
    "_UploadSavedSuccessfully.comment": "Message printed to console when a build request is successfully saved. {0} is the location it was saved to",
    "UploadSaving": "Saving build request payload to : {0}",
    "_UploadSaving.comment": "Message printed when we start to save a build request. {0} is the location we are trying to save to",
    "ErrorSavingTgz": "An error occurred while saving the uploaded tgz file to {0}: {1}",
    "_ErrorSavingTgz.comment": "{0} is the filename of the tgz, and {1} is the error message",
    "UploadExtractedSuccessfully": "Extracted app contents from uploaded build request to {0}. Requesting build.",
    "_UploadExtractedSuccessfully.comment": "Message printed to console when the uploaded build is successfully extracted. {0} is the location that the uploaded build was extracted to",
    "NewBuildQueued": "A build is currently building. Queuing up {0}",
    "_NewBuildQueued.comment": "Message printed to console when a build request is recieved when another build is in progress. {0} is the build number of the new request which is now in a queue",
    "NewBuildStarted": "Taking {0} as current build",
    "_NewBuildStarted.comment": "Message printed to console when beginning a build. {0} is the build number",
    "BuildDirectoryNotFound": "Build directory {0} does not exist.",
    "_BuildDirectoryNotFound.comment": "Message printed to console and returned to the client when ",
    "BuildMovingOn": "Done with current build. Checking for next build in queue.",
    "_BuildMovingOn.comment": "Message printed to console when a build is finished, successfully or otherwise, before continuing with any queued builds",
    "MalformedBuildInfo": "Unable to find appropriate package for specified build",
    "_MalformedBuildInfo.comment": "Message printed when a buildInfo object is missing a 'pkg' member. Shouldn't ever happen.",

    "NewBuildSubmitted": "New build request submitted:",
    "_NewBuildSubmitted.comment": "Message printed to the console when a new build is received",
    "BuildQueueFull": "Build request rejected. The build queue is full. Limit is {0} queued builds.",
    "_BuildQueueFull.comment": "Message returned to the caller when a build is rejected due to a full queue. {0} is the maximum number of builds",
    "FailedCreateDirectory": "Unable to create extract directory {0}: {1}",
    "_FailedCreateDirectory.comment": "Message printed to console and reported back to Visual Studio when unable to create the directory we want to unpack a build request to. {0} is the directory, and {1} is the message of the error",
    "NoTgzFound": "Build tgz file no longer exists on file system at {0}",
    "_NoTgzFound.comment": "Message printed to console and reported back to Visual Studio when unable to find the uploaded project. {0} is where the file was expected",
    "TgzExtractError": "An error occurred in extracting contents from {0}: {1}",
    "_TgzExtractError.comment": "Message printed to console and reported back to Visual Studio when an error occurs when extracting the tgz. {0} is the tgz file, and {1} is the error",

    "BuildInvokedTwice": "Invalid request: build.js process already in use but was asked to build again. This is likely a programming error as a build.js process is meant to be used only once.",
    "_BuildInvokedTwice.comment": "Message when multiple builds are invoked at the same time.",
    "BuildNotCompleted": "Requested build is not yet ready. Status: {0}",
    "_BuildNotCompleted.comment": "Message when attempting to perform an action on a build which is not yet ready. {0} is the current state of the build",
    "ExceededMaxPings": "Exceeded max # of pings: {0}",
    "_ExceededMaxPings.comment": "Error printed when the self test times out. {0} is the number of attempts made to get the build status",
    "CordovaAcquisitionFailed": "Failed to load Cordova {0}: {1}",
    "_CordovaAcquisitionFailed.comment": "Message printed when dynamically acquiring Cordova for the self test fails. {0} is the Cordova version, and {1} is the error message",

    "FirstRunDependencyConfiguration": "Configuring first-run dependencies.\nTo deploy to physical iOS devices, or to debug a device or simulator, we need some packages from Homebrew, a third party package manager.\nInstalling Homebrew may ask you for an admin password. Do you want to continue?",
    "_FirstRunDependencyConfiguration.comment": "Message displayed the first time remotebuild is run, asking for permission to install 3rd party dependencies",
    "HomebrewInstallationQuery": "[y]/n? ",
    "_HomebrewInstallationQuery.comment": "Message asking the user whether to install 3rd party dependencies. Hitting return will default to yes",
    "HomebrewInstallationQueryResponse": "y",
    "_HomebrewInstallationQueryResponse.comment": "Prefix indicating that the user consents to installing 3rd party dependencies. If the user's entry begins with this string, we assume it means yes, otherwise we assume it meanns no",
    "HomebrewInstallationFailed": "Error installing homebrew packages:\n{0}",
    "_HomebrewInstallationFailed.comment": "Message displayed if installing any of the 3rd party dependencies fails. {0} is the contents of the error",
    "HomebrewPackageVerificationFailed": "Error verifying homebrew packages:\n{0}\nConsider \"brew reinstall libimobiledevice ios-webkit-debug-proxy ideviceinstaller\" and trying again.",
    "_HomebrewPackageVerificationFailed.comment": "Message displayed if after installing the 3rd party dependencies, they do not work. {0} is the contents of the error",
    "HomebrewInstallationSuccess": "Successfully installed homebrew packages.\n",
    "_HomebrewInstallationSuccess.comment": "Message displayed when 3rd party dependencies are successfully installed",
    "HomebrewInstallationDeclined": "If you want to enable deploying to devices or debugging apps on devices or the simulator, delete {0} to be asked again.\n",
    "_HomebrewInstallationDeclined.comment": "Message displayed when the user opts out of installing 3rd party dependencies",

    "TacoRemoteHelpDescription": "taco-remote enables building Apache Cordova projects remotely.",
    "_TacoRemoteHelpDescription.comment": "Help message for this module",
    "TacoRemoteHelpNotes": "More documentation for configuring taco remote build can be found at <link>http://go.microsoft.com/fwlink/?LinkId=618174</link>",
    "_TacoRemoteHelpNotes.comment": "",
    "TacoRemoteHelpExample": "Use following config file to configure remotebuild port, web debug proxy port, no builds retention and build cleanup on shutdown",
    "_TacoRemoteHelpExample.comment": "Comments describing remote build configuration file options for an example which customizes web debug proxy port and build retention policy",

    "TacoRemoteConfigAllowsEmulate": "true if server should support running builds in iOS simulator, false if not (defaults to true if not specified)",
    "_TacoRemoteConfigAllowsEmulate.comment": "Help message printed for --allowsEmulate",
    "TacoRemoteConfigDeleteBuildsOnShutdown": "Delete all builds when the server is shutdown (defaults to true if not specified)",
    "_TacoRemoteConfigDeleteBuildsOnShutdown.comment": "Help message printed for --deleteBuildsOnShutdown",
    "TacoRemoteConfigMaxBuildsInQueue": "Maximum number of builds to allow in build queue. New builds over this limit are rejected (defaults to 10 if not specified)",
    "_TacoRemoteConfigMaxBuildsInQueue.comment": "Help message printed for --maxBuildsInQueue",
    "TacoRemoteConfigMaxBuildsToKeep": "Maximum number of builds to retain on disk (defaults to 20 if not specified)",
    "_TacoRemoteConfigMaxBuildsToKeep.comment": "Help message printed for --maxBuildsToKeep",
    "TacoRemoteConfigNativeDebugProxyPort": "Port number for native debugger (defaults to 3001 if not specified)",
    "_TacoRemoteConfigNativeDebugProxyPort.comment": "Help message printed for --nativeDebugProxyPort",
    "TacoRemoteConfigWebDebugProxyDevicePort": "Port number for webkit debugger device discovery (defaults to 9221 if not specified)",
    "_TacoRemoteConfigWebDebugProxyDevicePort.comment": "Help message printed for --webDebugProxyDevicePort",
    "TacoRemoteConfigWebDebugProxyPortMin": "First port number for webkit debugger to assign to devices (defaults to 9222 if not specified)",
    "_TacoRemoteConfigWebDebugProxyPortMin.comment": "Help message printed for --webDebugProxyPortMin",
    "TacoRemoteConfigWebDebugProxyPortMax": "Last port number for webkit debugger to assign to devices (defaults to 9322 if not specified)",
    "_TacoRemoteConfigWebDebugProxyPortMax.comment": "Help message printed for --webDebugProxyPortMax"
}
