{
	"IndexPageContent": "Remote build Express server open for business on port {0}",
	"_IndexPageContent.comment": "Message sent back in any request for index page of build server",

    "NoServerModulesSelected": "Warning: No server modules selected. Please make sure to specify a config with modules, e.g. \"modules\": {\"taco-cordova\": \"cordova\"} ",
    "_NoServerModulesSelected.comment": "",

	"UnauthorizedClientRequest": "The remote build server denied the build request, because the client certificate is invalid or has expired.  To build your project, you must generate and configure a security PIN. See http://go.microsoft.com/fwlink/?LinkID=511904.",
	"_UnauthorizedClientRequest.comment": "Message sent back to Visual Studio when a build request is submitted to a secure server with invalid client certificate",
	"InvalidPIN": "Invalid PIN in request",
	"_InvalidPIN.comment": "Message sent back to Visual Studio if an invalid PIN is submitted to download client SSL certificate",
	"ClientCertNotFoundForPIN": "Client certificate not found for PIN",
	"_ClientCertNotFoundForPIN.comment": "Message sent back to Visual Studio if a PIN is submitted to for which no valid client SSL certificate is found",
	"CAFilesNotFound": "One or both of required CA files {0} and {1} not found.",
	"_CAFilesNotFound.comment": "Message printed to console when certificate files cannot be found. {0} and {1} are the files checked for certificates",
	"NoResourcesForLanguage": "No resources defined for language {0}",
	"_NoResourcesForLanguage.comment": "Message sent back in browser if user requests resources for a language that does not have specfic resources",

	"UnknownCommand": "Unknown command: %s",
	"_UnknownCommand.comment": "Message printed when an unknown option is specified. %s is the command",
	"UsageInformation": [
		"taco-remote Remote build server",
		"",
		"Usage:",
		"taco-remote command [options]",
		"",
		"Commands (defaults to start if no command specified):",
		"   start                     Starts the server",
		"   resetServerCert           Resets server SSL certificates",
		"   generateClientCert        Generate a new client certificate for use with Visual Studio",
		"",
		"General Options",
		"   --h[elp]                  Show this help text and exit",
		"   --v[ersion]               Show version information and exit",
		"",
		"Usage for starting server: taco-remote --serverDir [directory] --port [num] --secure [true|false] --pinTimeout [num] --allowsEmulate [true|false] --maxBuildsToKeep [num] --maxBuildsInQueue [num] --deleteBuildsOnShutdown [true|false] --config [path_to_config_file] --writePidToFile [true|false]",
		"",
		"Options",
		"   --serverDir               Root directory for server (defaults to ~/remote-builds if not specified)",
		"   --port                    Port number for server (defaults to 3000 if not specified)",
		"   --secure                  true for https with server/client SSL certs, false for plain http (defaults to true if not specified)",
		"   --pinTimeout              Number of minutes for which client SSL certs can be acquired (defaults to 10 minutes)",
		"   --allowsEmulate           true if server should support running builds in iOS simulator, false if not (defaults to true if not specified)",
		"   --maxBuildsToKeep         Maximum number of builds to retain on disk (defaults to 20 if not specified)",
		"   --maxBuildsInQueue        Maximum number of builds to allow in build queue. New builds over this limit are rejected (defaults to 10 if not specified)",
		"   --deleteBuildsOnShutdown  Delete all builds when the server is shutdown (defaults to true if not specified)",
		"   --config                  Path to server configuration file with any of these settings",
		"   --writePidToFile          true if the server should write its process ID to [serverDir]/running_process_id (defaults to false if not specified)",
		"   --nativeDebugProxyPort    Port number for native debugger (defaults to 3001 if not specified)",
		"   --webDebugProxyDevicePort Port number for webkit debugger device discovery (defaults to 9221 if not specified)",
		"   --webDebugProxyRangeMin   First port number for webkit debugger to assign to devices (defaults to 9222 if not specified)",
		"   --webDebugProxyRangeMax   Last port number for webkit debugger to assign to devices (defaults to 9322 if not specified)",
		"   --lang                    Language to use for console output (deafults to the language given by $LANG if not specified)",
		"",
		"NOTE: command line options override configuration file values.",
		"",
		"Usage for resetServerCert: taco-remote resetServerCert --serverDir [directory] --certExpirationDays [num]",
		"Options",
		"   --serverDir               Root directory for server (defaults to ~/remote-builds if not specified)",
		"   --certExpirationDays      Number of days after which the generated SSL certificates will expire (defaults to 5 years if not specified)",
		"",
		"Usage for generateClientCert: taco-remote generateClientCert --serverDir [directory] --certExpirationDays [num]",
		"Options",
		"   --serverDir               Root directory for server (defaults to ~/remote-builds if not specified)",
		"   --certExpirationDays      Number of days after which the generated SSL certificates will expire (defaults to 5 years if not specified)",
		"",
		"Examples:",
		"Start the server with all defaults (secure server with serverDir ~/remote-builds, port 3000)",
		"taco-remote",
		"",
		"Start the server with a different serverDir, port, and http (non-secure)",
		"taco-remote --serverDir ~/other-builds --port 4000 --secure false",
		"",
		"Reset server certificates to expire in 1 year",
		"taco-remote resetServerCert --certExpirationDays 365",
		"",
		"Generate a new client certificate for use in Visual Studio, that will expire in 1 year",
		"taco-remote generateClientCert --certExpirationDays 365"
	],
	"_UsageInformation.comment": "Usage information to be printed when the -h argument is specified, or unknown arguments are given. The entries are combined with newlines before printing",

	"OSXCertSetupInformation": [
		"Use the following information under Tools, Options, Tools for Apache Cordova, Remote Agent Configuration to configure this agent:",
		"",
		"Enable remote iOS processing: True",
		"Host: {0}",
		"Port: {1}",
		"Secure mode: True",
		"Security PIN: {2}"
	],
	"_OSXCertSetupInformation.comment": "{0} is the host name or IP address of the machine, {1} is the port number that the server is running on, {2} is the 6 digit generated PIN",
	"OSXCertSetupNoPinTimeout": "The security PIN is for one-time use. To generate additional PINs, use the following command:",
	"_OSXCertSetupNoPinTimeout.comment": "Message printed to console explaining how to generate new PINs. The following line is a console command to generate the certificates",
	"OSXCertSetupPinTimeout": "The security PIN is for one-time use and expires in {0} minutes. To generate additional PINs, use the following command:",
	"_OSXCertSetupPinTimeout.comment": "Message printed to console explaining how to generate new PINs. {0} is the number of minutes that the PIN lasts for. The following line is a console command to generate the certificates",
	"CertExpirationInvalid": "certExpirationdays {0} would result in expired certs. Default cert expiration {1} days will be used instead.",
	"_CertExpirationInvalid.comment": "message printed to console when the user-configurable value certExpirationDays is invalid. {0} is the user-supplied value, and {1} is the value we are defaulting to",
    "CertificatesNotConfigured": "Error: Certificates not yet initialized!",
    "_CertificatesNotConfigured.comment": "Error returned when certificates are accessed before initialization.",

	"NotRunAsRoot": "****** taco-remote should not be run as root. Shutting down.",
	"_NotRunAsRoot.comment": "Message printed when taco-remote is run as root, instructing the user not to do so",
	"ServerStartFailed": "****** Failed to start server: %s",
	"_ServerStartFailed.comment": "Message printed when the taco-remote server fails to start. %s is the underlying error",
	"InsecureServerStarted": "Remote build server listening on [http] port %d",
	"_InsecureServerStarted.comment": "Message printed when the server is started in non-secure mode. %d is the port number",
	"SecureServerStarted": "Remote build server listening on [https] port %d",
	"_SecureServerStarted.comment": "Message printed when the server is started in secure mode. %d is the port number",
	"ServerPortInUse": "Unable to start server on port {0}. Address already in use.",
	"_ServerPortInUse.comment": "Message printed when the server cannot be started due to the port already being used. {0} is the port",
	"UncaughtErrorShutdown": "****** Server will shutdown due to uncaught error ****** ",
	"_UncaughtErrorShutdown.comment": "Message printed when an uncaught error is encountered",
	"ServerShutdown": "****** Performing server shutdown procedures.",
	"_ServerShutdown.comment": "Message printed when the server shuts down from an error or after the user requests it."
}