{
    "UnsupportedDependenciesHeader": "The installation of the following dependencies is not supported; please install them manually:",
    "_UnsupportedDependenciesHeader.comment": "Message displayed at the top of the list of dependencies that can't be installed by taco-cli.",
    "DependencyLabel": "Dependency: ",
    "_DependencyLabel.comment": "Label for the name of a dependency. This will be followed by the actual name of the dependency.",
    "DependencyVersion": "Version: {0}",
    "_DependencyVersion.comment": "Label and value for the version of a dependency. {0} is the version of the dependency.",
    "InstallDestination": "Install to: {0}",
    "_InstallDestination.comment": "Label and value for the version of a dependency. {0} is the version of the dependency.",
    "DependencyLicense": "License terms: {0}",
    "_DependencyLicense.comment": "Label and value for the url to the license terms of a dependency. {0} is the url.",
    "InstallingDependenciesHeader": "The following dependencies will be installed on your system:",
    "_InstallingDependenciesHeader.comment": "Message displayed at the top of the list of dependencies that are going to be installed by taco-cli",
    "ProceedLicenseAgreement": "Please type 'yes' to confirm and proceed. Some of the dependencies listed above require a license agreement. By proceeding, you acknowledge having read, understood and accepted the terms and conditions of each license.",
    "_ProceedLicenseAgreement.comment": "Message displayed after listing the dependencies that will be installed, when at least one of the dependencies require a license agreement.",
    "Proceed": "Please type 'yes' to confirm and proceed.",
    "_Proceed.comment": "Message displayed after listing the dependencies that will be installed, when none of the dependencies require a license agreement.",
    "YesExampleString": "[yes]: ",
    "_YesExampleString.comment": "When the user gets prompted to type 'yes' to accept the agreement, this will be shown as an example of what the user has to type.",
    "YesString": "yes",
    "_YesString.comment": "The string that the user needs to type to proceed with the installation.",
    "InstallationSuccessful": "Success! The installation completed successfully.",
    "_InstallationSuccessful.comment": "Message shown after all dependencies have been installed and there are no errors",
    "DownloadingLabel": "Downloading...",
    "_DownloadingLabel.comment": "Progress indicator for when a dependency is being downloaded.",
    "InstallingLabel": "Installing...",
    "_InstallingLabel.comment": "Progress indicator for when a dependency is being installed.",
    "InstallingNpmLabel": "Installing via npm...",
    "_InstallingNpmLabel.comment": "Progress indicator for when a dependency is being installed via npm.",
    "SettingSystemVariablesLabel": "Updating system environment variables...",
    "_SettingSystemVariablesLabel.comment": "Progress indicator for when a dependency is being installed via npm.",

    "UnsupportedPlatform": "Error: Unsupported platform: {0}",
    "_UnsupportedPlatform.comment": "Message printed when running on an operating system that we don't support. {0} is the platform.",
    "InstallationErrors": "The installation completed with some errors:",
    "_InstallationErrors.comment": "Message shown after all dependencies have been installed and there were errors.",
    "LicenseAgreementError": "Error: Must type 'yes' to proceed with the installation.",
    "_LicenseAgreementError.comment": "Error shown when the user doesn't type the correct acceptance string. In this string, 'yes' should exactly match the value for the 'yesString' string defined in this file.",
    "FileCorruptError": "Error: There is a problem with the downloaded installer file. Please try again later.",
    "_FileCorruptError.comment": "Error shown when the downloaded installer is corrupt or invalid."
}
